<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted'             => 'Трябва да приемете :attribute.',
    'active_url'           => 'Това поле не е валиден URL адрес.',
    'after'                => 'Това поле трябва да бъде дата след :date.',
    'after_or_equal'       => 'Това поле трябва да бъде дата след или равна на :date.',
    'alpha'                => 'Това поле трябва да съдържа само букви.',
    'alpha_dash'           => 'Това поле трябва да съдържа само букви, цифри, долна черта и тире.',
    'alpha_num'            => 'Това поле трябва да съдържа само букви и цифри.',
    'array'                => 'Това поле трябва да бъде масив.',
    'before'               => 'Това поле трябва да бъде дата преди :date.',
    'before_or_equal'      => 'Това поле трябва да бъде дата преди или равна на :date.',
    'between'              => [
        'numeric' => 'Това поле трябва да бъде между :min и :max.',
        'file'    => 'Това поле трябва да бъде между :min и :max килобайта.',
        'string'  => 'Това поле трябва да бъде между :min и :max знака.',
        'array'   => 'Това поле трябва да има между :min - :max елемента.',
    ],
    'boolean'              => 'Това поле трябва да съдържа Да или Не',
    'confirmed'            => 'Това поле не е потвърдено.',
    'date'                 => 'Това поле не е валидна дата.',
    'date_format'          => 'Това поле не е във формат :format.',
    'different'            => 'Това поле и :other трябва да са различни.',
    'digits'               => 'Това поле трябва да има :digits цифри.',
    'digits_between'       => 'Това поле трябва да има между :min и :max цифри.',
    'dimensions'           => 'Това поле съдържа изобраьение с невалидни размери.',
    'distinct'             => 'Това поле съдържа дублирана стойност.',
    'email'                => 'Това поле е в невалиден формат.',
    'exists'               => 'Избранато поле вече съществува.',
    'file'                 => 'Стойността в това поле трябва да бъде файл.',
    'filled'               => 'Това поле е задължително.',
    'image'                => 'Стойността в това поле трябва да бъде изображение.',
    'in'                   => 'Избраното поле е невалидно.',
    'in_array'             => 'Избраното поле не съществува в :other.',
    'integer'              => 'Това поле трябва да бъде цяло число.',
    'ip'                   => 'Това поле трябва да бъде IP адрес.',
    'ipv4'                 => 'Това поле трябва да бъде IPv4 адрес.',
    'ipv6'                 => 'Това поле трябва да бъде IPv6 адрес.',
    'json'                 => 'Това поле трябва да бъде JSON низ.',
    'max'                  => [
        'numeric' => 'Това поле трябва да бъде по-малко от :max.',
        'file'    => 'Това поле трябва да бъде по-малко от :max килобайта.',
        'string'  => 'Това поле трябва да бъде по-малко от :max знака.',
        'array'   => 'Това поле трябва да има по-малко от :max елемента.',
    ],
    'mimes'                => 'Това поле трябва да бъде файл от тип: :values.',
    'mimetypes'            => 'Това поле трябва да бъде файл от тип: :values.',
    'min'                  => [
        'numeric' => 'Това поле трябва да бъде минимум :min.',
        'file'    => 'Това поле трябва да бъде минимум :min килобайта.',
        'string'  => 'Това поле трябва да бъде минимум :min знака.',
        'array'   => 'Това поле трябва има минимум :min елемента.',
    ],
    'not_in'               => 'Избраното поле е невалидно.',
    'numeric'              => 'Това поле трябва да бъде число.',
    'present'              => 'Полето :attribute трябва да присъства.',
    'regex'                => 'Това поле е в невалиден формат.',
    'required'             => 'Това поле е задължително.',
    'required_if'          => 'Това поле се изисква, когато :other е :value.',
    'required_unless'      => 'Това поле е задължително освен ако :other е :values.',
    'required_with'        => 'Това поле се изисква, когато :values има стойност.',
    'required_with_all'    => 'Това поле е задължително, когато :values имат стойност..',
    'required_without'     => 'Това поле се изисква, когато :values няма стойност.',
    'required_without_all' => 'Това поле се изисква, когато никое от полетата :values нямат стойност.',
    'same'                 => 'Това поле и :other трябва да съвпадат.',
    'size'                 => [
        'numeric' => 'Това поле трябва да бъде :size.',
        'file'    => 'Това поле трябва да бъде :size килобайта.',
        'string'  => 'Това поле трябва да бъде :size знака.',
        'array'   => 'Това поле трябва да има :size елемента.',
    ],
    'string'               => 'Това поле трябва да бъде знаков низ.',
    'timezone'             => 'Това поле трябва да съдържа валидна часова зона.',
    'unique'               => 'Тази стойност вече съществува.',
    'uploaded'             => 'Това не може да се качи.',
    'url'                  => 'Тази стойност е в невалиден формат.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [],

];
